; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	infrared2 - mode
	image1 - mode
	spectrograph0 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star5 - direction
	Star6 - direction
	GroundStation8 - direction
	Star9 - direction
	GroundStation11 - direction
	Star12 - direction
	Star13 - direction
	Star7 - direction
	Star10 - direction
	Star14 - direction
	GroundStation4 - direction
	Star3 - direction
	Star15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 image1)
	(calibration_target instrument0 Star14)
	(calibration_target instrument0 Star7)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation11)
	(supports instrument1 infrared2)
	(supports instrument1 image1)
	(calibration_target instrument1 Star14)
	(calibration_target instrument1 Star10)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
	(supports instrument2 infrared2)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
)
(:goal (and
	(pointing satellite1 GroundStation1)
	(have_image Star15 spectrograph0)
	(have_image Phenomenon16 image1)
	(have_image Phenomenon17 infrared2)
))

)

; plan
1. (turn_to satellite2 groundstation4 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 groundstation4)
   goals met: 1 of 4
2. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 1 of 4
3. (calibrate satellite2 instrument2 groundstation4)
   added: (calibrated instrument2)
   goals met: 1 of 4
4. (turn_to satellite2 phenomenon17 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 phenomenon17)
   goals met: 1 of 4
5. (turn_to satellite0 star14 groundstation11)
   deleted: (pointing satellite0 groundstation11)
   added: (pointing satellite0 star14)
   goals met: 1 of 4
6. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 4
7. (calibrate satellite0 instrument0 star14)
   added: (calibrated instrument0)
   goals met: 1 of 4
8. (take_image satellite2 phenomenon17 instrument2 infrared2)
   added: (have_image phenomenon17 infrared2)
   goals met: 2 of 4
9. (turn_to satellite0 phenomenon16 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 phenomenon16)
   goals met: 2 of 4
10. (take_image satellite0 phenomenon16 instrument0 image1)
   added: (have_image phenomenon16 image1)
   goals met: 3 of 4
11. (turn_to satellite2 star15 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 star15)
   goals met: 3 of 4
12. (take_image satellite2 star15 instrument2 spectrograph0)
   added: (have_image star15 spectrograph0)
   goals met: 4 of 4
